{
    "model_type": "llama",
    "architectures": [
        "LlamaForCausalLM"
    ],
    "base_model": "TinyLlama-1.1B-Chat-v1.0",
    "framework": "DARF",
    "num_hidden_layers": 22,
    "hidden_size": 2048,
    "num_attention_heads": 32,
    "num_key_value_heads": 4,
    "intermediate_size": 5632,
    "vocab_size": 32000,
    "max_position_embeddings": 2048,
    "hidden_act": "silu",
    "torch_dtype": "float32",
    "status": "placeholder"
}